app/views/static_pages/root.html.erb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "testuser1"], ["LIMIT", 1]]
---
    window.currentUser = {
            "id": <%= current_user.id %>,
            "username": "<%= current_user.username %>",
            "first_name": "<%= current_user.first_name %>",
            "last_name": "<%= current_user.last_name %>",
            "balance": "<%= current_user.balance %>"