app/controllers/application_controller.rb

  def current_user

    return nil unless session[:session_token]
    @current_user ||= User.find_by(session_token: session[:session_token]) #we find user
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "VCwX8Sy3sXcmt1RjMts8Gg"], ["LIMIT", 1]]