app/models/user.rb

  def calculate_balance
    self.balance = user_stock.pluck(:amount, :unit_price).inject(0) { |sum, stock| sum + stock[0] * stock[1]}
    self.save!
---
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "balance", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"